POS = {'имя существительное': ['ия', 'ашк', 'ашка', 'ашко', 'ишк', 'ишка', 'ишко', 'ышк', 'ышка', 'ышко', 'ышки', 'ышке', 'ашки', 'ушк', 'ушка', 'ушко','ушки','ушке', 'юшк','юшка','юшко','юшке','юшки','юшкы','ашкы','ушкы','ишкы','ек','еки','екы','ека','ика','ики','ик','икы','ок','ока','оке','оки','окы','око', 'чик','чика','чики','чицы','чику','чике','ец','еца','ецы','иц','ицы','еце','ице','ица','ечк','ечка','ечки', 'ечкы', 'ечко','ичк','ичка','ичко','ицо','ецо','ичке','ички','ичкы','очк','очка','очкы','очки','очке','очкя','еньк','енька','енько','енькя','еньки','енькы','еньке','оньк','онька','онькя','оньки','онькы','енк','енка','енко','енки','енки','ёнк','ёнка','ёнко','ёнке','ёнки','ёнкы','инк','инка','инкы','инки','инке','инко','енко','онк','онка','онко','онке', 'онки','онкы','ин','ина','ино','ины','ини','ине','ищ','ища','ище','ищи','ищо','к','ка','ко','ки','кы','ке','ушек','ушка','ушки','ушкы','ушко','ышек','ышка','ышке','ышкы','ышки','ак','аки','акы','як','яки','якы','ан','анка','аны','ани','анкы','анки','анко','ян','яни','яно','янка','янкы','яны','анин','анка','ане','ани','аны','анки','анке','янин','яне','яни','яны','ач','ачка','аче','ачо','ачи','ачки','ачкы','ачко','ев','ево','ева','еви','евы','евка','евки','евкы','ёвка','ёвки','ёвкы','ив','ивы','иви','иве','ивка','ивки','ивкы','евич', 'евичи', 'евн','евны','евни', 'ович' ,'овичи','овн','овны','овни','ич','ичи','ична','ичны','ични','иничн','инична','иничны','инични','ени','ение','ении','ения','ние','ние','ния','ет','ета','ето','еты','ети','от','ота','оты','оти','ото','еств','ества','ество','естви','ествы','ство','ств','ства','стви','ствы','есть','ести','есты','ость','ости','осты','цы', 'ец','ецка','ецы','ецкы','ецки','изм','измы','изн','изны','изни','изна','ик','ики','икы','ике','ник','ника','ники','никы','нико','ино','ина''ин','ини','ины','ист','исти','исты','иска','истки','исткы','иц','ицо','ице','ицы','ицка','ицки','ицкы','ниц','ница','ницы','ницки','ницкы','иха', 'ихи','ихы','к','ка','кы','ки','ко','ке','ила','ала','илы','алы','ыль','ыли','иль','или','ыло','лко','лка','лки','лкы','льня','льни','льны','льник','льники','льщик','льщики','льщица','льщицы','тель','тели','тельница','тельницы','итель', 'ители','ительница','ительницы','ун','уны','уни','унка','унки','ункы','чик','чики','чица','чицы','щики','щицы','чиц','чицы','щик', 'щица'],
 'имя прилагательное': ['алый', 'алая', 'алое', 'алые', 'елый', 'елая', 'елое', 'елые', 'аная', 'аный', 'аное','аные', 'яный', 'яная', 'яное', 'яные', 'янный', 'янная', 'янное', 'янные', 'анный', 'анные', 'анная', 'анное','аной', 'яной', 'астый', 'астая', 'астое', 'астые', 'астой', 'атый', 'атая', 'атое', 'атые', 'атие', 'ев', 'евая', 'евые', 'евое','евые', 'ов', 'овый', 'овая','овое', 'овые', 'овие', 'еват', 'еватая', 'еватое', 'еватые', 'еватый', 'оват', 'оватый', 'оватая', 'оваток', 'оватые', 'енный', 'енная', 'енное', 'енные', 'еннен', 'онный', 'онная', 'онное', 'онные', 'енский', 'енская', 'енское', 'енские', 'енскые', 'енскый', 'инский', 'инская','инское', 'инские', 'енький', 'енькая','енькое', 'енькый', 'енькие', 'енькые', 'онький', 'онькый', 'онькая', 'онькое', 'онькие', 'онькые', 'ехонький', 'ехонькая', 'ехонькое', 'ехонькие', 'ехонькый', 'ехонькые', 'ёхонький', 'ёхонькый', 'ёхонькая', 'ёхонькое', 'ёхонькие','ёхонькые', 'оханькый', 'оханькая', 'оханькое', 'оханький','оханькие', 'оханькые', 'ешенький', 'ешенькый','ешенькая', 'ешенькое', 'ешенькие', 'ешенькые','ёшенькая', 'ёшенький', 'ёшенькый', 'ёшенькое', 'ёшенькие', 'ёшенькые', 'ошенький', 'ошенькый', 'ошенькая', 'ошенькое', 'ошенькие', 'ошенькые', 'ив', 'ивый', 'ивая', 'ивое', 'ивые', 'ивие', 'ий', 'ничий', 'ая', 'ничая', 'ое', 'ничее', 'ее', 'ие', 'ничие', 'ильный', 'ильная', 'ильний','ильное', 'ильние', 'ильные', 'ин', 'иный', 'иная', 'иное', 'иные', 'иние', 'иняя', 'инский', 'инская', 'инское', 'инские', 'инскый', 'инскые', 'истый', 'истая', 'истое', 'истые', 'истие', 'итый', 'итая', 'итое', 'итые', 'итие', 'овитый', 'овитая', 'овитое', 'овитые', 'овитие', 'кий', 'кая', 'кое', 'кие', 'кые', 'цкий', 'цкая', 'цкое', 'цкие', 'лой', 'лый', 'лая', 'лое', 'лые', 'лие', 'ливый', 'ливая', 'ливое', 'ливые', 'ний', 'ная', 'няя', 'ное', 'ные', 'ние','ный', 'шний', 'шный', 'шная', 'шняя', 'шное', 'шние', 'шные', 'ский', 'ская', 'ское', 'ские','скые', 'тельный','тельний', 'тельная', 'тельняя', 'тельное', 'тельные', 'тельние', 'учий', 'учая', 'учое', 'учие', 'уч', 'уча', 'учи', 'уче', 'ючий','ючая','ючое', 'ючие', 'юч', 'юча', 'ючи', 'юче', 'ячий', 'ячая', 'ячее', 'ячие', 'яч', 'яча', 'ячи', 'яче', 'чатый', 'чатая', 'чатые', 'чатое', 'чивый', 'чивая', 'чивое', 'чивые', 'ливый', 'ливая', 'ливое', 'ливые', 'янистый', 'янистая', 'янистое', 'янистые'],
 'глагол': ['ться','ать','ять','оть','еть','ёть','уть','ють','ыть','ить','эть','л','ла','ло','ли','ю','ешь','ишь','ашь','ушь','юшь','ышь','ёшь','яшь','те','ем','ём','ум','ут','ют','ат','ят','ите','ете','и'],
 'причастие': ['у','ущий','ущая','ущие','ущее','уща','уще','ущи','ющ','ющий','юща','ющая','юще','ющее','ющи','ющие','ащ','ащий','аща','ащая','аще','ащее','ащи','ащие','ящ','ящий','яща','ящая','яще','ящее','ящи','ящие','вший','вшая','вшее','вшие','вш','вша','вше','вша','ший','шая','шое','шие','емый','емая','емое','емые','имый','имые','им','имая','имое','тый','тая','тое','тые'],
 'деепричастие': ['ча','мя', 'а','я', 'вши', 'ши'],
 'наречие': ['че','ова','ко','ающе','льно','ованно','ски','жды','учи','ючи'],
 'числительное': ['десят','сот','адцать','дцать']}

others = {'союз/частица': ['а', 'абы', 'аж', 'ан', 'благо', 'буде', 'будто', 'вроде', 'да', 'дабы', 'даже','едва', 'ежели', 'если', 'же', 'зато', 'затем', 'и', 'ибо', 'или', 'итак', 'кабы', 'как', 'когда', 'коли', 'коль', 'ли', 'либо', 'лишь', 'нежели', 'но', 'пока', 'покамест', 'покуда', 'поскольку', 'притом', 'причем', 'пускай','пусть', 'раз', 'разве', 'ровно','словно', 'так', 'также', 'тоже', 'только', 'точно', 'хоть', 'хотя', 'чем', 'чисто', 'что', 'чтоб', 'чтобы', 'чуть', 'якобы'],
 'предлог':['в', 'без', 'до', 'из', 'к', 'на', 'по', 'о', 'от', 'перед', 'при', 'через', 'с', 'у', 'за', 'над', 'об', 'под', 'про', 'для','вблизи', 'вглубь', 'вдоль', 'возле', 'около', 'вокруг', 'впереди', 'послесредством', 'насчёт', 'ввиду', 'в течени','несмотря на', 'из-под', 'из-за', 'по-над'],
 'местоимение':['я','ты','он','она', 'мы', 'вы','они', 'себя','кто','никто','мой','твой','наш','свой','тот','этот'],
 'числительные':['один','два','три','четыре','пять','шесть','семь','восемь','девять','десять','сто','миллион','тысяча','миллиард']}

def find_POS(string):
    res = []
    if string in others['союз/частица']:
        res.append([1, '', 'союз/частица'])
    elif string in others['предлог']:
        res.append([1, '', 'предлог'])
    elif string in others['местоимение']:
        res.append([1, '', 'местоимение'])
    elif string in others['числительные']:
        res.append([1, '', 'числительные'])
    else:
        for index in range(-1, -7, -1):
            for part_of_speech, affixes in POS.items():
                if string[index:] in affixes:
                    res.append([len(string[index:]), string[index:], part_of_speech])
    try:
        print('Ваше слово скорее всего является - {}'.format(max(res)[2]))
        print('Вот, что нашла программа - {}'.format(res))
    except ValueError as error:
        print('Для слова не удалось найти ни одного аффикса в базе данных')


STOP = True
while STOP:
    word = input('Введите слово >>>')
    find_POS(word)
    stop = input('Введете следующее слово? Да/Нет')
    if stop == 'Нет':
        STOP = False
        
